[
  {
    "id": 100,
    "name": "OOP",
    "body": "Object-Oriented Programming was the subject we spent the most time learning in school. Starting with a Zoo application, and progressing on to more advanced projects like my Capstone project.",
    "modaltext": "Through out my entire time in school, we spent a great deal of time learning about Object-Oriented Programming and the four pillars - abstraction, encapsulation, inheritance, and polymorphism. In order to learn these principles of OOP, we created an application to replicate a zoo using C# and Visual Studio. Our first semester, our class was called Programming Concepts and taught us everything on a conceptual level and had us first write our code with all variables being hard coded. From there, we were able to learn the four pillars by refactoring the code to use inheritance and slowly start encapsulating code as we added more features and abilities for the user. In our second semester, our class was simply called Object-Oriented Programming and that's when the majority of our features were added to complete the application. Our third and final semester, our class was called Object-Oriented Design and it was in this class that we were taught about design patterns such as Singleton and Factory patterns as well as learning about anti-patterns such as Blobs ('God Objects'), Spaghetti Code, and Cut/Paste Programming. For our Final project in that class, we were tasked with creating a simple application using three design patterns. I created a simple text-based game using Singleton to create a single instance of the game - Factory pattern to create different objects/values used in the game, and Builder to create the a 'container' of sorts to hold the objects created by my Factory.",
    "imageurl": "src/images/OOP-logo.png"
  },
  {
    "id": 101,
    "name": "C#",
    "body": "C# is the language that was taught the most consistently alongside MS SQL. We were introduced to C# with our Zoo application, and continued to use it through-out school and in my Capstone project as well.",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Csharp-logo.png"
  },
  {
    "id": 102,
    "name": "ASP.NET Core",
    "body": "This is ASP.NET Core text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/NETCore-logo.png"
  },
  {
    "id": 103,
    "name": "Entity Framework Core",
    "body": "This is Entity Framework Core text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Entity-logo.png"
  },
  {
    "id": 104,
    "name": "MS SQL Server",
    "body": "This is SQL text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/SQL-logo.png"
  },
  {
    "id": 105,
    "name": "Power BI",
    "body": "This is Power BI text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/PowerBI-logo.png"
  },
  {
    "id": 106,
    "name": "Blazor",
    "body": "This is Blazor text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Blazor-logo.png"
  },
  {
    "id": 107,
    "name": "React",
    "body": "This is React text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/React-logo.png"
  },
  {
    "id": 200,
    "name": "Adobe",
    "body": "This is Adobe text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Adobe-logo.png"
  },
  {
    "id": 201,
    "name": "Photography",
    "body": "This is Photography ladjflkjads lljads lkfj dsalkfj ldsakj flkdasj flkdsaj flkadsj flkdsja lkfjd aslkfj addsaffljdka lfdj alkfjdlk fjlkdasj flkadsj flkjdsalkfj daskjf lksdaj flksdaj flkjasdlfkjadsflklkfj ladskjf lsdakjf lkdsaj frlkdja sfldsaj ljkf  text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Camera-logo.png"
  },
  {
    "id": 202,
    "name": "Animation",
    "body": "This is Animation text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Animation-logo.png"
  },
  {
    "id": 301,
    "name": "Music",
    "body": "This is Music text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Music-logo.png"
  },
  {
    "id": 302,
    "name": "Comedy",
    "body": "This is Comedy text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/Comedy-logo.png"
  },
  {
    "id": 303,
    "name": "Disc Golf",
    "body": "This is Disc Golf text",
    "modaltext": "Test modal text",
    "imageurl": "src/images/PDGA-logo.png"
  }
]
